// ignore_for_file: equal_keys_in_map

import 'package:get/get.dart';

class LocaleString extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'km_KH': {
          // Guest Dashboard
          'ព្រឹត្តិការណ៍': 'ព្រឹត្តិការណ៍',
          'ការចុះឈ្មោះ': 'ការចុះឈ្មោះ',
          'កម្មវិធីសិក្សា': 'កម្មវិធីសិក្សា',
          'អាហារូបករណ៍': 'អាហារូបករណ៍',
          'មជ្ឈមណ្ឌលការងារ': 'មជ្ឈមណ្ឌលការងារ',
          'វីដេអូ': 'វីដេអូ',
          'ទំនាក់ទំនង': 'ទំនាក់ទំនង',
          'អំពីយើង': 'អំពីយើង',
          'ផ្លាស់ប្ដូរភាសា': 'ផ្លាស់ប្ដូរភាសា',
          'FAQ': 'FAQ',
          'ទំព័រដើម': 'ទំព័រដើម',
          'ចូលគណនី': 'ចូលគណនី',

          // Notification
          'មកដល់ឆាប់ៗនេះ!!!': 'មកដល់ឆាប់ៗនេះ!!!',
          'ព័ត៌មានថ្មីៗ': 'ព័ត៌មានថ្មីៗ',

          // Credit
          '\tក្រេឌីតសរុប\t': '\tក្រេឌីតសរុប\t',
          'ស្ថាប័ន៖ ': 'ស្ថាប័ន៖ ',
          'ចាំពេលក្រោយ': 'ចាំពេលក្រោយ',
          'លេខទំនាក់ទំនង៖': 'លេខទំនាក់ទំនង៖',
          'ទំនាក់ទំនងប្រព័ន្ធផ្សព្វផ្សាយសង្គម៖':
              'ទំនាក់ទំនងប្រព័ន្ធផ្សព្វផ្សាយសង្គម៖',
          'ទីតាំងរបស់សកលវិទ្យាល័យ៖': 'ទីតាំងរបស់សកលវិទ្យាល័យ៖',
          'គ្មានការតភ្ជាប់អ៊ីនធឺណិត...': 'គ្មានការតភ្ជាប់អ៊ីនធឺណិត...',
          'យល់ព្រម': 'យល់ព្រម',
          'អ៊ីនធឺណិតបានត្រឡប់មកវិញ...': 'អ៊ីនធឺណិតបានត្រឡប់មកវិញ...',
          'ចូលការកំណត់': 'ចូលការកំណត់',
          'បច្ចុប្បន្នអ្នកនៅក្រៅបណ្តាញ': 'បច្ចុប្បន្នអ្នកនៅក្រៅបណ្តាញអ៊ីនធឺណិត',
          'សូមពិនិត្យមើលការកំណត់នៃការតភ្ជាប់អ៊ីនធឺណិតរបស់អ្នកម្ដងទៀត។':
              'សូមពិនិត្យមើលការកំណត់នៃការតភ្ជាប់អ៊ីនធឺណិតរបស់អ្នកម្ដងទៀត។',
          'បច្ចុប្បន្នបណ្តាញអ៊ីនធឺណិតគឺបានបិទ':
              'បច្ចុប្បន្នបណ្តាញអ៊ីនធឺណិតគឺបានបិទ',
          'សូមពិនិត្យមើលការកំណត់ និងបើកការតភ្ជាប់អ៊ីនធឺណិត។':
              'សូមពិនិត្យមើលការកំណត់ និងបើកការតភ្ជាប់អ៊ីនធឺណិត។',

          // News Event
          'ព្រឹត្តិការណ៍បច្ចុប្បន្ន': 'ព្រឹត្តិការណ៍បច្ចុប្បន្ន',
          'ព្រឹត្តិការណ៍នាពេលខាងមុខ': 'ព្រឹត្តិការណ៍នាពេលខាងមុខ',
          'ព្រឹត្តិការណ៍មុនៗ': 'ព្រឹត្តិការណ៍មុនៗ',

          // Program
          '\t\tស្វែងរក': '\t\tស្វែងរក...',
          'ឆ្នាំទី១': 'ឆ្នាំទី១',
          'ឆ្នាំទី២': 'ឆ្នាំទី២',
          'ឆ្នាំទី៣': 'ឆ្នាំទី៣',
          'ឆ្នាំទី៤': 'ឆ្នាំទី៤',
          'ឆមាសទី១': 'ឆមាសទី១',
          'ឆមាសទី២': 'ឆមាសទី២',
          'ឆមាសទី 1': 'ឆមាសទី 1',
          'ឆមាសទី 2': 'ឆមាសទី 2',
          'មុខវិជ្ជា': 'មុខវិជ្ជា',
          'ម៉ោង': 'ម៉ោង',
          'ក្រេឌីត': 'ក្រេឌីត',
          'សរុប': 'សរុប',
          'សប្ដាហ៍': 'សប្ដាហ៍',
          'ម៉ោងសរុប': 'ម៉ោងសរុប',
          '\tម៉ោង/សប្ដាហ៍': '\tម៉ោង/សប្ដាហ៍',
          '\tស្វែងរកមុខជំនាញ': '\tស្វែងរកមុខជំនាញ',

          // Scholarship
          'សាកលវិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ': 'សាកលវិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ',
          'ក្នុងសាកលវិទ្យាល័យ': 'ក្នុងសាកលវិទ្យាល័យ',
          'ក្រៅសាកលវិទ្យាល័យ': 'ក្រៅសាកលវិទ្យាល័យ',
          'អានបន្ថែម': 'អានបន្ថែម',
          'ថ្ងៃផុតកំណត់៖ ': 'ថ្ងៃផុតកំណត់៖ ',

          //Video
          'មើលទាំងអស់ ': 'មើលទាំងអស់ ',
          'វីដេអូពី Youtube': "វីដេអូពី Youtube",

          // Contact
          'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ':
              'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ',
          'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។':
              'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។',

          // About US
          'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា':
              'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា',
          'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ': 'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ',
          'សាររបស់សាកលវិទ្យាធិការ': 'សាររបស់សាកលវិទ្យាធិការ',
          'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ': 'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ',
          'ការទទួលស្គាល់': 'ការទទួលស្គាល់',

          // Change Language
          'ភាសា': 'ភាសា',
          'សូមជ្រើសរើសភាសា': 'សូមជ្រើសរើសភាសា',
          'ភាសាខ្មែរ': 'ភាសាខ្មែរ',
          'ភាសាអង់គ្លេស': 'ភាសាអង់គ្លេស',

          // Account
          'គណនីនិស្សិត': 'គណនីនិស្សិត',
          'គណនីអាណាព្យាបាល': 'គណនីអាណាព្យាបាល',
          'គណនីបុគ្គលិក': 'គណនីបុគ្គលិក',
          'គណនីសាស្ត្រាចារ្យ': 'គណនីសាស្ត្រាចារ្យ',

          // Student Dashboard
          'ព័ត៌មានលម្អិតរបស់និស្សិត': 'ព័ត៌មានលម្អិតរបស់និស្សិត',
          'កាលវិភាគ': 'កាលវិភាគ',
          'ដំណើរការសិក្សា': 'ដំណើរការសិក្សា',
          'វត្តមាន': 'វត្តមាន',
          'ការបង់ប្រាក់': 'ការបង់ប្រាក់',
          'ប្រវត្តិការងារ': 'ប្រវត្តិការងារ',
          'ព័ត៌មានការសិក្សា': 'ព័ត៌មានការសិក្សា',
          'មតិកែលម្អ': 'មតិកែលម្អ',
          'សមិទ្ធិផល': 'សមិទ្ធិផល',
          'ស្វាគមន៍': 'ស្វាគមន៍',
          'ការកំណត់': 'ការកំណត់',

          // Student Login
          'គណនីនិសិ្សត': 'គណនីនិសិ្សត',
          'អត្តលេខនិស្សិត': 'អត្តលេខនិស្សិត',
          '\t\tបញ្ចូលអត្តលេខ\t': '\t\tបញ្ចូលអត្តលេខ\t',
          'សូមបញ្ចូលអត្តលេខ': 'សូមបញ្ចូលអត្តលេខ',
          'ពាក្យសម្ងាត់': 'ពាក្យសម្ងាត់',
          '\t\tបញ្ចូលពាក្យសម្ងាត់': '\t\tបញ្ចូលពាក្យសម្ងាត់',
          'សូមបញ្ចូលពាក្យសម្ងាត់': 'សូមបញ្ចូលពាក្យសម្ងាត់',
          'ចូល': 'ចូល',
          'ឬ': 'ឬ',
          'ចូលដោយប្រើកូដ QR ស្កេន': 'ចូលដោយប្រើកូដ QR ស្កេន',
          'អត្តលេខនិស្សិត ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!':
              'អត្តលេខនិស្សិត ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!',
          'សូមបញ្ចូលអត្តលេខ និងសូមបញ្ចូលពាក្យសម្ងាត់':
              'សូមបញ្ចូលអត្តលេខ និងសូមបញ្ចូលពាក្យសម្ងាត់',
          'អ្នកចូលគណនីបានជោគជ័យ': 'អ្នកចូលគណនីបានជោគជ័យ',
          'ចាកចេញពីគណនី?': 'Logging out?',
          'មិនទាន់មានគណនីទេឬ?\t': 'មិនទាន់មានគណនីទេឬ?\t',
          'ទំនាក់ទំនងក្រុមការងារ': 'ទំនាក់ទំនងក្រុមការងារ',

          // Student Detail
          'ឆ្នាំ': 'ឆ្នាំ',
          'ឆមាស': 'ឆមាស',
          'ជំនាន់': 'ជំនាន់',
          'វគ្គ': 'វគ្គ',
          'ឆ្នាំសិក្សា': 'ឆ្នាំសិក្សា',
          'មហាវិទ្យាល័យ': 'មហាវិទ្យាល័យ',
          'កម្រិតសិក្សា': 'កម្រិតសិក្សា',
          'មុខជំនាញ': 'មុខជំនាញ',
          'បន្ទប់សិក្សា': 'បន្ទប់សិក្សា',
          'វេនសិក្សា': 'វេនសិក្សា',
          'ស្ថានភាពសិក្សា': 'ស្ថានភាពសិក្សា',
          'ថ្ងៃកំណើត': 'ថ្ងៃកំណើត',
          'លេខទូរស័ព្ទ': 'លេខទូរស័ព្ទ',
          'មុខតំណែង': 'មុខតំណែង',
          'ស្ថាប័ន': 'ស្ថាប័ន',

          // Student Log out
          'ចាកចេញ': 'ចាកចេញ',
          'តើអ្នកប្រាកដថាអ្នកនឹងចាកចេញពីគណនីនិសិ្សតដែរឬទេ?':
              'តើអ្នកប្រាកដថាអ្នកនឹងចាកចេញពីគណនីនិសិ្សតដែរឬទេ?',
          'បោះបង់': 'បោះបង់',
          'ទាញយក QR': 'ទាញយក QR',
          'រូបរាង': 'រូបរាង',
          'ទម្រង់ងងឹត': 'ទម្រង់ងងឹត',
          'បង្កើត QR': 'បង្កើត QR',

          // Student Survey
          'សូមជួយវាយដម្លៃការបង្រៀនរបស់សាស្ត្រាចារ្យ':
              'សូមជួយវាយដម្លៃការបង្រៀនរបស់សាស្ត្រាចារ្យ',
          '\tចំនួនក្រេឌីតសរុប': '\tចំនួនក្រេឌីតសរុប',
          '\tចំនួនក្រេឌីតបានបំពេញ': '\tចំនួនក្រេឌីតបានបំពេញ',
          'សូមជួយធ្វើការវាយតម្លៃ': 'សូមជួយធ្វើការវាយតម្លៃ',
          'ការវាយតម្លៃ': 'ការវាយតម្លៃ',
          'សូមជ្រើសរើសប្រភេទនៃការវាយតម្លៃ!!!':
              'សូមជ្រើសរើសប្រភេទនៃការវាយតម្លៃ!!!',
          'ការវាយតម្លៃទី 1': 'ការវាយតម្លៃទី 1',
          'ការវាយតម្លៃទី 2': 'ការវាយតម្លៃទី 2',

          // Student Schedule
          'កាលវិភាគសិក្សា': 'កាលវិភាគសិក្សា',
          'January': 'មករា',
          'February': 'កុម្ភៈ',
          'March': 'មីនា',
          'April': 'មេសា',
          'May': 'ឧសភា',
          'June': 'មិថុនា',
          'July': 'កក្កដា',
          'August': 'សីហា',
          'September': 'កញ្ញា',
          'October': 'តុលា',
          'November': 'វិច្ឋិកា',
          'December': 'ធ្នូ',

          // Student Perfomance
          'មធ្យមភាគ': 'មធ្យមភាគ',
          'ពិន្ទុមធ្យមភាគ': 'ពិន្ទុមធ្យមភាគ',
          'និទ្ទេស': 'និទ្ទេស',
          'ចំណាត់ថ្នាក់ប្រចាំថ្នាក់ៈ': 'ចំណាត់ថ្នាក់ប្រចាំថ្នាក់ៈ',
          'ពិន្ទុ': 'ពិន្ទុ',
          'លំហាត់': 'លំហាត់',
          'កិច្ចការផ្ទះ': 'កិច្ចការផ្ទះ',
          'កិច្ចការក្រុម': 'កិច្ចការក្រុម',
          'ពាក់កណ្ដាលឆមាស': 'ពាក់កណ្ដាលឆមាស',
          'កិច្ចការផ្ទះ និងស្រាវជ្រាវ': 'កិច្ចការផ្ទះ និងស្រាវជ្រាវ',
          'ប្រលងពាក់កណ្ដាលឆមាស': 'ប្រលងពាក់កណ្ដាលឆមាស',
          'ប្រលងបញ្ចប់ឆមាស': 'ប្រលងបញ្ចប់ឆមាស',
          'ប្រឡងសង': 'ប្រឡងសង',
          'លក្ខណៈវិនិច្ឆ័យ': 'លក្ខណៈវិនិច្ឆ័យ',
          'ពិន្ទុផ្លូវការ': 'ពិន្ទុផ្លូវការ',
          'ពិន្ទុជាក់ស្ដែង': 'ពិន្ទុជាក់ស្ដែង',
          'ភាគរយ': 'ភាគរយ',
          'ពិន្ទុសរុប': 'ពិន្ទុសរុប',

          // Student Attendance
          'វត្តមាន\t': 'វត្តមាន\t',
          'យឺត': 'យឺត',
          'សុំច្បាប់': 'សុំច្បាប់',
          'អវត្តមាន': 'អវត្តមាន',
          '\tក្រេឌីត\t': '\tក្រេឌីត\t',
          '\tម៉ោង': '\tម៉ោង',
          'មើលទាំងអស់': 'មើលទាំងអស់',
          'ឆ្នាំទី​ ១': 'ឆ្នាំទី​ ១',
          'ឆ្នាំទី​ ២': 'ឆ្នាំទី​ ២',
          'ឆ្នាំទី​ ៣': 'ឆ្នាំទី​ ៣',
          'ឆ្នាំទី​ ៤': 'ឆ្នាំទី​ ៤',
          'ឆ្នាំទី​ 1': 'ឆ្នាំទី​ 1',
          'ឆ្នាំទី​ 2': 'ឆ្នាំទី​ 2',
          'ឆ្នាំទី​ 3': 'ឆ្នាំទី​ 3',
          'ឆ្នាំទី​ 4': 'ឆ្នាំទី​ 4',
          'ឆ្នាំទី​ ': 'ឆ្នាំទី​ ',
          'ឆមាសទី ១': 'ឆមាសទី ១',
          'ឆមាសទី ២': 'ឆមាសទី ២',
          'Year I': 'ឆ្នាំទី​ ១',
          'Year II': 'ឆ្នាំទី​ ២',
          'Year III': 'ឆ្នាំទី​ ៣',
          'Year IV': 'ឆ្នាំទី​ ៤',
          'Semester I': 'ឆមាសទី ១',
          'Semester II': 'ឆមាសទី ២',
          'កាលបរិច្ឆេទ': 'កាលបរិច្ឆេទ',
          'ម៉ោងសិក្សា': 'ម៉ោងសិក្សា',
          'ឆមាសទី ': 'ឆមាសទី ',

          // Student Payment
          'ការបង់ថ្លៃឈ្នួលសិក្សា': 'ការបង់ថ្លៃឈ្នួលសិក្សា',
          'ការបង់ថ្លៃឈ្នួលប្រឡងឡើងវិញ': 'ការបង់ថ្លៃឈ្នួលប្រឡងឡើងវិញ',
          'ការបង់ថ្លៃឈ្នួលរៀនបំពេញក្រេឌីត': 'ការបង់ថ្លៃឈ្នួលរៀនបំពេញក្រេឌីត',
          'ការបង់ថ្លៃឈ្នួលដកលិខិតបញ្ជាក់ការសិក្សាផ្សេងៗ':
              'ការបង់ថ្លៃឈ្នួលដកលិខិតបញ្ជាក់ការសិក្សាផ្សេងៗ',
          'ទឹកប្រាក់ត្រូវបង់': 'ប្រាក់ត្រូវបង់',
          'ទឹកប្រាក់បានបង់': 'ប្រាក់បានបង់',
          'ទឹកប្រាក់នៅសល់': 'ប្រាក់នៅសល់',
          'លេខវិក័យបត្រ': 'លេខវិក័យបត្រ',

          // Student Job History
          'កាលបរិច្ឆេទចូលបម្រើការងារ​\t\t\t\t\t':
              'កាលបរិច្ឆេទចូលបម្រើការងារ​\t\t\t\t\t',
          'ស្ថានភាពការងារ': 'ស្ថានភាពការងារ',
          'ប្រាក់បៀវត្ស': 'ប្រាក់បៀវត្ស',

          // Student Study Info
          'មុខវិជ្ជា\t': 'មុខវិជ្ជា\t',
          'បន្ទប់\t': 'បន្ទប់\t',
          'ម៉ោង\t': 'ម៉ោង\t',
          'លេខតុ\t': 'លេខតុ\t',
          'ដកបេក្ខភាព': 'ដកបេក្ខភាព',
          'ថ្ងៃផុតកំណត ': 'ថ្ងៃផុតកំណត ',
          'ម៉ោង ': 'ម៉ោង ',
          'ឈ្មោះ': 'ឈ្មោះ',
          'បន្ទប់': 'បន្ទប់',
          'សាស្ត្រចារ្យ': 'សាស្ត្រចារ្យ',
          'ព័ត៌មានការប្រឡង': 'ព័ត៌មានការប្រឡង',
          'កិច្ចការផ្ទះ និងស្រាវជ្រាវ\t (Not Available)':
              'កិច្ចការផ្ទះ និងស្រាវជ្រាវ\t (Not Available)',
          'មិនទាន់មានការប្រឡងនោះទេ!': 'មិនទាន់មានការប្រឡងនោះទេ!',

          // Student Feedback
          'សូមអធ្យាស្រ័យ': 'សូមអធ្យាស្រ័យ',
          'សូមអធ្យាស្រ័យលោកអ្នកមិនទាន់អាចធ្វើការ Feedback បាននៅឡើយទេ!!!':
              'សូមអធ្យាស្រ័យលោកអ្នកមិនទាន់អាចធ្វើការ Feedback បាននៅឡើយទេ!!!',
          'គ្មានទិន្ន័យ': 'គ្មានទិន្ន័យ',

          // Student Achievement
          'សូមអបអរសាទរ': 'សូមអបអរសាទរ',
          'មិនទាន់បានបញ្ចប់': 'មិនទាន់បានបញ្ចប់',

          // Guardian Login
          'អត្តលេខអាណាព្យាបាល': 'អត្តលេខអាណាព្យាបាល',
          '\t\tបញ្ចូលអត្តលេខ': '\t\tបញ្ចូលអត្តលេខ',
          'សូមបញ្ចូលអត្តលេខ': 'សូមបញ្ចូលអត្តលេខ',
          'ពាក្យសម្ងាត់': 'ពាក្យសម្ងាត់',
          '\t\tបញ្ចូលពាក្យសម្ងាត់': '\t\tបញ្ចូលពាក្យសម្ងាត់',
          'សូមបញ្ចូលពាក្យសម្ងាត់': 'សូមបញ្ចូលពាក្យសម្ងាត់',
          'ចូល': 'ចូល',
          'អត្តលេខអាណាព្យាបាល ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!':
              'អត្តលេខអាណាព្យាបាល ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!',

          // Guardian Log out
          'តើអ្នកប្រាកដថាអ្នកនឹងចាកចេញពីគណនីអាណាព្យាបាលដែរឬទេ?':
              'តើអ្នកប្រាកដថាអ្នកនឹងចាកចេញពីគណនីអាណាព្យាបាលដែរឬទេ?',
        },
        'en_US': {
          // Guest Dashboard
          'ព្រឹត្តិការណ៍': 'Events',
          'ការចុះឈ្មោះ': 'Registration',
          'កម្មវិធីសិក្សា': 'Program',
          'អាហារូបករណ៍': 'Scholarship',
          'មជ្ឈមណ្ឌលការងារ': 'Career Center',
          'វីដេអូ': 'Video',
          'ទំនាក់ទំនង': 'Contact',
          'អំពីយើង': 'About US',
          'ផ្លាស់ប្ដូរភាសា': 'Language',
          'FAQ': 'FAQ',
          'ទំព័រដើម': 'Home',
          'ចូលគណនី': 'Account',

          // News Event
          'ព្រឹត្តិការណ៍បច្ចុប្បន្ន': 'Current Events',
          'ព្រឹត្តិការណ៍នាពេលខាងមុខ': 'Upcoming Events',
          'ព្រឹត្តិការណ៍មុនៗ': 'Past Events',

          '\tក្រេឌីតសរុប\t': '\tTotal Credits\t',
          'ស្ថាប័ន៖ ': 'Company:',
          'ចាំពេលក្រោយ': 'Read Later',
          'លេខទំនាក់ទំនង៖': 'Contact Tel:',
          'ទំនាក់ទំនងប្រព័ន្ធផ្សព្វផ្សាយសង្គម៖': 'Social media contact:',
          'ទីតាំងរបស់សកលវិទ្យាល័យ៖': 'Location of the University:',
          'គ្មានការតភ្ជាប់អ៊ីនធឺណិត...': 'No Internet Connection...',
          'យល់ព្រម': 'OK',
          'អ៊ីនធឺណិតបានត្រឡប់មកវិញ...': 'The internet is back...',
          'ចូលការកំណត់': 'Settings',
          'បច្ចុប្បន្នអ្នកនៅក្រៅបណ្តាញ': 'You are currently offline',
          'សូមពិនិត្យមើលការកំណត់នៃការតភ្ជាប់អ៊ីនធឺណិតរបស់អ្នកម្ដងទៀត។':
              'Please check your internet connection settings again.',
          'បច្ចុប្បន្នបណ្តាញអ៊ីនធឺណិតគឺបានបិទ': 'Cellular Data is Turned Off',
          'សូមពិនិត្យមើលការកំណត់ និងបើកការតភ្ជាប់អ៊ីនធឺណិត៊។':
              'Turn on cellular data and get back to access data.',

          // Program
          '\t\tស្វែងរក': '\t\tSearch...',
          'ឆ្នាំទី១': 'Year 1',
          'ឆ្នាំទី២': 'Year 2',
          'ឆ្នាំទី៣': 'Year 3',
          'ឆ្នាំទី៤': 'Year 4',
          'ឆមាសទី១': 'Semester I',
          'ឆមាសទី២': 'Semester II',
          'មុខវិជ្ជា': 'Subject',
          'ម៉ោង': 'Hours',
          'ក្រេឌីត': 'Credits',
          'សរុប': 'Total',
          'សប្ដាហ៍': 'Weeks',
          'ម៉ោងសរុប': 'Total Hour',
          '\tម៉ោង/សប្ដាហ៍': '\thours/week',
          '\tស្វែងរកមុខជំនាញ': '\tSearch Major',

          // Scholarship
          'សាកលវិទ្យាល័យ សៅស៍អ៊ីសថ៍អេយសៀ': 'University of South-East Asia',
          'ក្នុងសាកលវិទ្យាល័យ': 'Inside University',
          'ក្រៅសាកលវិទ្យាល័យ': 'Other University',
          'អានបន្ថែម': 'Read more',
          'ថ្ងៃផុតកំណត់៖ ': 'Expired Date: ',

          //Video
          'មើលទាំងអស់ ': 'View All',
          'វីដេអូពី Youtube': "Youtube's Video",

          // Contact
          'ចូលឆានែលតេឡេក្រាមរបស់សកលវិទ្យាល័យ':
              'Access the University Telegram Channel',
          'ភូមិវត្តបូព៌ សង្កាត់សាលាកំរើក ស្រុកសៀមរាប ខេត្តសៀមរាប​ ព្រះរាជាណាចក្រកម្ពុជា (ទល់មុខវិទ្យាល័យអង្គរ)។':
              'Wat Bo Village, Sangkat Salakamroek, Siem Reap District, Siem Reap Province, Kingdom of Cambodia (Opposite Angkor High School).',

          // About US
          'ប្រវត្តិ និងអត្ថន័យរបស់និមិត្តសញ្ញា': 'History and Logo meaning',
          'រចនាសម្ព័ន្ធរបស់សាកលវិទ្យាល័យ': 'University Structure',
          'សាររបស់សាកលវិទ្យាធិការ': 'President Message',
          'ចក្ខុវិស័យ បេសកកម្ម និងគុណតម្លៃ': 'Vision Mission and Core Value',
          'ការទទួលស្គាល់': 'Recognition',

          // Change Language
          'ភាសា': 'Language',
          'សូមជ្រើសរើសភាសា': 'Please select the language',
          'ភាសាខ្មែរ': 'KHMER',
          'ភាសាអង់គ្លេស': 'ENGLISH',

          // Notification
          'ព័ត៌មានថ្មីៗ': 'Notification',
          'មកដល់ឆាប់ៗនេះ!!!': 'Coming Soon!!!',

          // Account
          'គណនីនិស្សិត': 'Student Account',
          'គណនីអាណាព្យាបាល': 'Guardian Account',
          'គណនីបុគ្គលិក': 'Staff Account',
          'គណនីសាស្ត្រាចារ្យ': 'Lecturer Account',

          // Student Dashboard
          'ព័ត៌មានលម្អិតរបស់និស្សិត': 'Student Detail',
          'កាលវិភាគ': 'Schedule',
          'ដំណើរការសិក្សា': 'Performance',
          'វត្តមាន': 'Attendance',
          'ការបង់ប្រាក់': 'Payment',
          'ប្រវត្តិការងារ': 'Job History',
          'ព័ត៌មានការសិក្សា': 'Study Info',
          'មតិកែលម្អ': 'Feedback',
          'សមិទ្ធិផល': 'Achievements',
          'ស្វាគមន៍': 'Welcome!',
          'ការកំណត់': 'Settings',

          // Student Login
          'គណនីនិសិ្សត': 'Student Account',
          'អត្តលេខនិស្សិត': 'Student ID',
          '\t\tបញ្ចូលអត្តលេខ\t': '\t\tInput Student ID\t',
          'សូមបញ្ចូលអត្តលេខ': 'Please Input Student ID',
          'ពាក្យសម្ងាត់': 'Password',
          '\t\tបញ្ចូលពាក្យសម្ងាត់': '\t\tInput Password',
          'សូមបញ្ចូលពាក្យសម្ងាត់': 'Please Input Password',
          'ចូល': 'Log In',
          'ឬ': 'Or',
          'ចូលដោយប្រើកូដ QR ស្កេន': 'Login with QR Scan',
          'អត្តលេខនិស្សិត ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!':
              'Incorrect Student ID or Password. Please Input Again!!!',
          'សូមបញ្ចូលអត្តលេខ និងសូមបញ្ចូលពាក្យសម្ងាត់':
              'Please Input Student ID and Input password',
          'អ្នកចូលគណនីបានជោគជ័យ': 'You have successfully logged in!',
          'មិនទាន់មានគណនីទេឬ?\t': 'Don\'t have an account? ',
          'ទំនាក់ទំនងក្រុមការងារ': 'Contact Us',
          // Student Detail
          'ឆ្នាំ': 'Year',
          'ឆមាស': 'Semester',
          'ជំនាន់': 'Promotion',
          'វគ្គ': 'Stage',
          'ឆ្នាំសិក្សា': 'Academic Year',
          'មហាវិទ្យាល័យ': 'Faculty',
          'កម្រិតសិក្សា': 'Education',
          'មុខជំនាញ': 'Major',
          'បន្ទប់សិក្សា': 'Room',
          'វេនសិក្សា': 'Shift',
          'ស្ថានភាពសិក្សា': 'Study Status',
          'ថ្ងៃកំណើត': 'Date of birth',
          'លេខទូរស័ព្ទ': 'Phone Number',
          'មុខតំណែង': 'Position',
          'ស្ថាប័ន': 'Institutions',

          // Student Log out
          'ចាកចេញ': 'Log out',
          'តើអ្នកប្រាកដថាអ្នកនឹងចាកចេញពីគណនីនិសិ្សតដែរឬទេ?':
              'Are you sure you want to log out student account?',
          'បោះបង់': 'Cancel',
          'ចាកចេញពីគណនី?': 'Loggin out?',
          'ទាញយក QR': 'Save QR',
          'រូបរាង': 'Appearances',
          'ទម្រង់ងងឹត': 'Night Mode',
          'បង្កើត QR': 'Get QR',

          // Student Survey
          '\tចំនួនក្រឌីតសរុប': '\tTotal Credits',
          '\tចំនួនក្រឌីតបានបំពេញ': '\tRemaining Credits',
          'សូមជួយវាយដម្លៃការបង្រៀនរបស់សាស្ត្រាចារ្យ':
              'Please evaluate the lecture of the professor',
          'សូមជួយធ្វើការវាយតម្លៃ': 'Could you please help evaluate this?',
          'ការវាយតម្លៃ': 'Evaluation',
          'សូមជ្រើសរើសប្រភេទនៃការវាយតម្លៃ!!!':
              'Please select number of survey!!!',
          'ការវាយតម្លៃទី 1': 'Survey 1',
          'ការវាយតម្លៃទី 2': 'Survey 2',

          // Student Schedule
          'កាលវិភាគសិក្សា': 'Schedule',
          'January': 'January',
          'February': 'February',
          'March': 'March',
          'April': 'April',
          'May': 'May',
          'June': 'June',
          'July': 'July',
          'August': 'August',
          'September': 'September',
          'October': 'October',
          'November': 'November',
          'December': 'December',

          // Student Performance
          'មធ្យមភាគ': 'Average',
          'ពិន្ទុមធ្យមភាគ': 'GPA',
          'និទ្ទេស': 'Grade',
          'ពិន្ទុ': 'Score',
          'លំហាត់': 'Exercises',
          'កិច្ចការផ្ទះ': 'Homework',
          'កិច្ចការក្រុម': 'Assignment',
          'ពាក់កណ្ដាលឆមាស': 'Mid-term',
          'ប្រឡងសង': 'Re-Exam',
          'កិច្ចការផ្ទះ និងស្រាវជ្រាវ': 'Homework',
          'ប្រលងពាក់កណ្ដាលឆមាស': 'Mid-Term Exam',
          'ប្រលងបញ្ចប់ឆមាស': 'Final Exam',
          'លក្ខណៈវិនិច្ឆ័យ': 'Criteria',
          'ពិន្ទុផ្លូវការ': 'Final Score',
          'ពិន្ទុជាក់ស្ដែង': 'Score',
          'ភាគរយ': 'Percent',
          'ពិន្ទុសរុប': 'Total Score',

          // Student Attendance
          'ឆមាសទី ': 'Semester ',
          'វត្តមាន\t': 'Present',
          'យឺត': 'Late',
          'សុំច្បាប់': 'Permission',
          'អវត្តមាន': 'Absent',
          '\tក្រេឌីត\t': '\tCredits\t',
          '\tម៉ោង': '\tHours',
          'មើលទាំងអស់': 'Read all',
          'ឆ្នាំទី​ ១': 'Year I',
          'ឆ្នាំទី​ ២': 'Year II',
          'ឆ្នាំទី​ ៣': 'Year III',
          'ឆ្នាំទី​ ៤': 'Year IV',
          'ឆ្នាំទី​ 1': 'Year I',
          'ឆ្នាំទី​ 2': 'Year II',
          'ឆ្នាំទី​ 3': 'Year III',
          'ឆ្នាំទី​ 4': 'Year IV',
          'ឆ្នាំទី​ ': 'Year ',
          'ឆមាសទី ១': 'Semester I',
          'ឆមាសទី ២': 'Semester II',
          'ឆមាសទី 1': 'Semester I',
          'ឆមាសទី 2': 'Semester II',
          'Year I': 'Year I',
          'Year II': 'Year II',
          'Year III': 'Year III',
          'Year IV': 'Year IV',
          'Semester I': 'Semester I',
          'Semester II': 'Semester II',
          'កាលបរិច្ឆេទ': 'Date',
          'ម៉ោងសិក្សា': 'Study Hour',

          // Student Payment
          'ឆ្នាំទី​ ': 'Year ',
          'ការបង់ថ្លៃឈ្នួលសិក្សា': 'Tuition payment',
          'ការបង់ថ្លៃឈ្នួលប្រឡងឡើងវិញ': 'Re-examination fee payment',
          'ការបង់ថ្លៃឈ្នួលរៀនបំពេញក្រេឌីត':
              'Tuition fee to complete the credit',
          'ការបង់ថ្លៃឈ្នួលដកលិខិតបញ្ជាក់ការសិក្សាផ្សេងៗ':
              'Fees, withdrawals, certificates of study',
          'ទឹកប្រាក់ត្រូវបង់': 'To pay',
          'ទឹកប្រាក់បានបង់': 'Paid',
          'ទឹកប្រាក់នៅសល់': 'Remain',
          'លេខវិក័យបត្រ': 'Invoice',

          // Student Job History
          'កាលបរិច្ឆេទចូលបម្រើការងារ​\t\t\t\t\t': 'Date of entry\t\t\t\t\t',
          'ស្ថានភាពការងារ': 'Job Status',
          'ប្រាក់បៀវត្ស': 'Salary',

          // Student Study Info
          'មុខវិជ្ជា\t': 'Subject\t',
          'បន្ទប់\t': 'Room\t',
          'ម៉ោង\t': 'Time\t',
          'លេខតុ\t': 'Seat\t',
          'ដកបេក្ខភាព': 'Take Out',
          'ថ្ងៃផុតកំណត ': 'Expired Date ',
          'ម៉ោង ': 'Time ',
          'ឈ្មោះ': 'Name',
          'បន្ទប់': 'Room',
          'សាស្ត្រចារ្យ': 'Lecturer',
          'ព័ត៌មានការប្រឡង': 'Exam Information',
          'កិច្ចការផ្ទះ និងស្រាវជ្រាវ\t (Not Available)':
              'Assignment and Research\t (Not Available)',
          'មិនទាន់មានការប្រឡងនោះទេ!': 'No Study Information available',

          // Student Feedback
          'សូមអធ្យាស្រ័យ': 'Apologies for any trouble',
          'សូមអធ្យាស្រ័យលោកអ្នកមិនទាន់អាចធ្វើការ Feedback បាននៅឡើយទេ!!!':
              'Sorry, you have not been able to provide feedback yet!!!',
          'គ្មានទិន្ន័យ': 'No Data',

          // Student Achievement
          'សូមអបអរសាទរ': 'Congratulations',
          'មិនទាន់បានបញ្ចប់': 'Achievement Locked',

          // Guardian Login
          'អត្តលេខអាណាព្យាបាល': 'Guardian ID',
          '\t\tបញ្ចូលអត្តលេខ': '\t\tInput Guardian ID',
          'សូមបញ្ចូលអត្តលេខ': 'Please Input Guardian ID',
          'ពាក្យសម្ងាត់': 'Password',
          '\t\tបញ្ចូលពាក្យសម្ងាត់': '\t\tInput Password',
          'សូមបញ្ចូលពាក្យសម្ងាត់': 'Please Input Password',
          'ចូល': 'Log In',
          'អត្តលេខអាណាព្យាបាល ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ។ សូមបញ្ចូលម្ដងទៀត!!!':
              'Incorrect Guardian ID or Password. Please Input Again!!!',

          // Guardian Log out
          'តើអ្នកប្រាកដថាអ្នកនឹងចាកចេញពីគណនីអាណាព្យាបាលដែរឬទេ?':
              'Are you sure you want to log out guardian account?',
        },
      };
}
